<template>
  <div>
    <div class="topNav">
      <router-link to='/me' class="topLeft">
        <svg t="1647521094216" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="13086" width="48" height="48"><path d="M902.779659 795.440467c-6.179746-6.181793-14.304797-9.577123-22.950711-9.577123L129.341299 785.863345c-17.945721 0-32.540114 14.59644-32.540114 32.525788 0 17.962094 14.594393 32.555463 32.540114 32.555463l750.487649 0c17.931395 0 32.525788-14.594393 32.525788-32.555463C912.354735 809.745265 908.959406 801.61919 902.779659 795.440467" p-id="13087" fill="#2c2c2c"></path><path d="M879.828948 461.055724 129.341299 461.055724c-17.945721 0-32.525788 14.594393-32.525788 32.541137 0 17.930371 14.580067 32.525788 32.525788 32.525788l750.487649 0c17.931395 0 32.525788-14.594393 32.525788-32.525788 0-8.647961-3.39533-16.800641-9.575076-22.980387C896.599913 464.436728 888.474862 461.055724 879.828948 461.055724" p-id="13088" fill="#2c2c2c"></path><path d="M902.779659 154.426115c-6.179746-6.179746-14.304797-9.574053-22.950711-9.574053L129.341299 144.852062c-17.945721 0-32.540114 14.594393-32.540114 32.540114 0 17.946744 14.594393 32.525788 32.540114 32.525788l750.487649 0c17.931395 0 32.525788-14.579043 32.525788-32.525788C912.354735 168.745239 908.959406 160.606885 902.779659 154.426115" p-id="13089" fill="#2c2c2c"></path></svg>
      </router-link>
      <div class="topCenter">
        <router-link to='/me'>我的</router-link>
        <span class="navBtn active">发现</span>
        <span class="navBtn">云村</span>
        <span class="navBtn">视频</span>
      </div>

      <div class="topRight">
        <van-badge class="announce" dot>
          <svg @click="showAnnouncement" t="1647864085286" class="icon" viewBox="0 0 1026 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2225" width="48" height="48"><path d="M115.479782 1024A115.536809 115.536809 0 0 1 0 908.520218V335.284284a115.479782 115.479782 0 0 1 115.536809-115.479782H280.5731L489.805356 10.686299a34.216232 34.216232 0 0 1 7.014328-5.702705 35.470827 35.470827 0 0 1 32.790555-1.710811l1.596758 0.741351 2.566217 1.482704 0.627297 0.399189a38.436234 38.436234 0 0 1 3.991894 3.079461l1.425676 1.311622 209.17523 209.118203h161.899803A115.479782 115.479782 0 0 1 1026.48695 335.284284v573.12188a115.479782 115.479782 0 0 1-115.479782 115.479782z m-41.059478-681.758416v555.899711a50.297861 50.297861 0 0 0 50.354887 50.29786H902.738245a50.297861 50.297861 0 0 0 50.297861-50.29786V342.241584a50.297861 50.297861 0 0 0-50.297861-50.29786H821.18956l50.012725 50.012725a35.470827 35.470827 0 0 1-50.126779 50.126779l-100.139505-100.139504H308.687437L208.547932 392.083228a35.470827 35.470827 0 0 1-50.126779-50.126779l50.012725-50.012725H124.832219a50.297861 50.297861 0 0 0-50.411915 50.29786z m306.349327-122.380055h268.027148L514.783205 85.904982zM263.636065 797.716655a29.254878 29.254878 0 1 1 0-57.027053h499.499955a29.254878 29.254878 0 1 1 0 57.027053z m0-228.108211a29.254878 29.254878 0 1 1 0-57.027053h499.499955a29.254878 29.254878 0 1 1 0 57.027053z" p-id="2226" fill="#2c2c2c"></path></svg>
        </van-badge>
        <router-link to="/search">
          <svg t="1647521134615" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="13329" width="48" height="48"><path d="M966.4 924.8l-230.4-227.2c60.8-67.2 96-156.8 96-256 0-217.6-176-390.4-390.4-390.4-217.6 0-390.4 176-390.4 390.4 0 217.6 176 390.4 390.4 390.4 99.2 0 188.8-35.2 256-96l230.4 227.2c9.6 9.6 28.8 9.6 38.4 0C979.2 950.4 979.2 934.4 966.4 924.8zM102.4 441.6c0-185.6 150.4-339.2 339.2-339.2s339.2 150.4 339.2 339.2c0 89.6-35.2 172.8-92.8 233.6-3.2 0-3.2 3.2-6.4 3.2-3.2 3.2-3.2 3.2-3.2 6.4-60.8 57.6-144 92.8-233.6 92.8C256 780.8 102.4 627.2 102.4 441.6z" p-id="13330"></path></svg>
        </router-link>

      </div>
    </div>
  </div>
</template>

<script>
// import {Dialog} from 'vant'
export default {
  name:'topNav',
  setup(props) {
    function showAnnouncement(){
      vant.Dialog.alert({
        title: '公告',
        message: '可用功能：\n播放歌曲以及一些常规的操作（例如随机播放），播放列表，搜索（仅限歌曲），歌单，评论区，下载，登陆（网易云账号，仅可用手机和密码登陆）\n\n点击我的即可登陆，登陆后可以查看歌单的所有歌曲，查看喜欢、创建和收藏的歌单，收藏/删除歌曲，查看最近播放，获取每日推荐歌曲和个性化推荐歌单\n\nps：最好在wifi下运行，歌曲多为高品和无损音质。由于接口的问题，某些操作的结果显示有一定延迟，可能延迟个一俩分钟。请关闭浏览器的视频悬窗！！！',
        messageAlign:"left"
      }).then(() => {
        // on close
      });

    }
    return{
      showAnnouncement
    }
  }
}
</script>

<style lang="less" scoped>
.topNav{
  width: 100vw;
  height: 1rem;
  display: flex;
  justify-content: space-between;
  align-items: center;
  padding: 0 0.2rem;
  .icon{
    width: 0.5rem;
    height: 0.5rem;
  }
  .topCenter{
    width: 3.5rem;
    display: flex;
    justify-content: space-between;
    .active{
      font-weight: 900;
    }
  }
  .topRight{
    display: flex;
    align-items: center;
    .announce{
      width: 0.45rem;
      height: 0.45rem;
      margin-top: -0.15rem;
      margin-right: 0.2rem;
    }

  }
}
a{
  text-decoration: none;
  color: black;
}
</style>